In [1]:
intro = '''
Built on top of numpy. Offers lot more functionality
'''

In [2]:
data_structures = '''
- Series
- Dataframe
- Panel

Series : 1D labeled homogenuous array, size immutable
Dataframe : General 2D labeled, size mutable table structure with potentially heterogenuously typed data
Panel : General 3D labeled, size mutable array
'''

In [3]:
series = '''
pandas.Series( data, index, dtype, copy)
default index is range(n) i.e 0,1,..,n-1
'''

In [11]:
import pandas as pd
import numpy as np

In [5]:
series = pd.Series([1,2,3])

In [6]:
series

0    1
1    2
2    3
dtype: int64

In [14]:
# Testing of copy
np_arr = np.array([1,2,3])
series = pd.Series(np_arr, index=[0,1,2], dtype=int, copy=False)
series.add(1)
np_arr

array([1, 2, 3])

In [17]:
# Series from dictionary. If no index is provided then all keys in sorted order are taken. Else provided indices are mapped to corresponding values
data = {'a':1, 'b':2, 'c':3, 'd':4}
s = pd.Series(data, index=['c','d','e'])
s

c    3.0
d    4.0
e    NaN
dtype: float64

In [18]:
# Series from Scalar
s = pd.Series(5, index=[0,1,2])
s

0    5
1    5
2    5
dtype: int64

In [22]:
# Retrieveing
s = pd.Series(2*np.arange(0,5), index=np.arange(0,5))
s

6

In [33]:
s[3]
type(s[3])

numpy.int64

In [98]:
s = pd.Series([1,2,3,4])
type(s[2])

numpy.int64

In [31]:
a = s[[3,4]] # returns a series
type(a)

pandas.core.series.Series

In [ ]:
# Dataframe
# dFrame = pd.Dataframe(data, index, columns, dtype, copy)

In [39]:
data = pd.DataFrame([['Alex',10],['Bob',12],['Clarke',13]]) # considers the input as an array of rows

In [40]:
data

        0   1
0    Alex  10
1     Bob  12
2  Clarke  13

In [43]:
pd.DataFrame([1,2,3])

   0
0  1
1  2
2  3

In [46]:
# this gives an error
# pd.DataFrame(1)

In [51]:
# DataFrame from dict of lists
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
pd.DataFrame(data)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [52]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
df

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [53]:
# DataFrame from list of dicts

In [54]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
pd.DataFrame(data)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [62]:
# pass list of dicts and use only part data by using columns
# if you pass 
data = [
    {'a':1, 'b':2, 'c':3, 'd':4},
    {'a':2, 'b':3, 'c':4, 'd':5},
    {'a':3, 'b':4, 'c':5, 'd':6},
    {'a':4, 'b':5, 'c':6, 'd':7},
]
pd.DataFrame(data, columns=['a','b'], index=[1,2,3,4])

   a  b
1  1  2
2  2  3
3  3  4
4  4  5

In [64]:
# if you pass only part index, you will get an error
# pd.DataFrame(data, columns=['a','b'], index=[1,2,3])

In [65]:
#From a dict of Series

In [69]:
data = pd.DataFrame(
    {
    'one': pd.Series([11,21,31,41], index=['o','t','t','f']),
    'two': pd.Series([12,22,32,42], index=['o','t','t','f'])
    }
)

   one  two
o   11   12
t   21   22
t   31   32
f   41   42

In [71]:
# Column selection

In [84]:
data = pd.DataFrame(
    {
    'one': pd.Series([11,21,31,41], index=['o','t','t','f']),
    'two': pd.Series([12,22,32,42], index=['o','t','t','f'])
    }
)

In [85]:
data['one']

o    11
t    21
t    31
f    41
Name: one, dtype: int64

In [93]:
data['two']

o    12
t    22
t    32
f    42
Name: two, dtype: int64

In [88]:
# Adding a new column
data['three'] = pd.Series([13,23,33,43], index=['o','t','t','f'])
data

   one  two  three
o   11   12     13
t   21   22     23
t   31   32     33
f   41   42     43

In [89]:
# Column deletion
del data['three']
data

   one  two
o   11   12
t   21   22
t   31   32
f   41   42

In [99]:
data['three'] = pd.Series([13,23,33,43], index=['o','t','t','f'])
data.pop('three')
data

   one  two
o   11   12
t   21   22
t   31   32
f   41   42

one    11
two    12
Name: o, dtype: int64

In [102]:
# Row selection

In [105]:
data.loc['o']

one    11
two    12
Name: o, dtype: int64

In [106]:
data.loc['t']

   one  two
t   21   22
t   31   32

In [121]:
# Row slicing
# If you dont use ':', it will give you that column
# Counter intuitively, if you use ':', it will slice rows, not columns
data[0:2]

   one  two
o   11   12
t   21   22

In [122]:
# Appending rows

In [130]:
data.append( pd.DataFrame([[61,62]], index=['s'], columns=['one', 'two']) )

   one  two
o   11   12
t   21   22
t   31   32
f   41   42
s   61   62

In [131]:
# Dropping rows

In [137]:
data.drop('t')

   one  two
o   11   12
f   41   42

In [138]:
# Panel

In [139]:
# We have names for each axes in Panel
# items - axis 0, each item corresponds to a DataFrame
# major_axis - axis 1, it is the index(row) of each of the DataFrames
# minor_axis - axis 2, it is the columns of each of the DataFrames
# https://raw.githubusercontent.com/mbonvini/EnergyAnalysisWithPandas/master/imgs/panel.png

In [141]:
# Series Basic functionality
s = pd.Series(np.random.randn(4))

In [142]:
s

0   -0.149228
1    0.806924
2   -0.160367
3   -0.172963
dtype: float64

In [144]:
s.axes

[RangeIndex(start=0, stop=4, step=1)]

In [145]:
s.empty

False

In [146]:
s.ndim

1

In [147]:
s.size

4

In [148]:
s.values

array([-0.14922809,  0.80692353, -0.16036717, -0.17296302])

In [151]:
# DataFrame Basic Functionality
# T, axes, dtypes, empty, ndim, shape, size, values, head(), tail()

In [160]:
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}
dF = pd.DataFrame(d)

In [161]:
dF

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80

In [164]:
dF.axes

[RangeIndex(start=0, stop=7, step=1),
 Index(['Name', 'Age', 'Rating'], dtype='object')]

In [165]:
dF.dtypes

Name       object
Age         int64
Rating    float64
dtype: object

In [166]:
dF.T

           0      1      2     3      4      5     6
Name     Tom  James  Ricky   Vin  Steve  Smith  Jack
Age       25     26     25    23     30     29    23
Rating  4.23   3.24   3.98  2.56    3.2    4.6   3.8

In [167]:
# Descriptive statistics

In [173]:
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])}
dF = pd.DataFrame(d)

In [178]:
dF

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [184]:
dF.sum(axis=0)
# it will snap that axes, aggregates over it and will be remained with remaining axes just like np.array

Name      TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...
Age                                                     382
Rating                                                44.92
dtype: object

In [182]:
dF.sum(axis=1)

0     29.23
1     29.24
2     28.98
3     25.56
4     33.20
5     33.60
6     26.80
7     37.78
8     42.98
9     34.80
10    55.10
11    49.65
dtype: float64

In [185]:
# describe
dF.describe()

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

In [189]:
dF.describe(include=['object']) # for summarizing String columns

         Name
count      12
unique     12
top     Steve
freq        1

In [191]:
dF.describe(include=['number'])

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

In [194]:
dF.describe(include='all')

         Name        Age     Rating
count      12  12.000000  12.000000
unique     12        NaN        NaN
top     Steve        NaN        NaN
freq        1        NaN        NaN
mean      NaN  31.833333   3.743333
std       NaN   9.232682   0.661628
min       NaN  23.000000   2.560000
25%       NaN  25.000000   3.230000
50%       NaN  29.500000   3.790000
75%       NaN  35.500000   4.132500
max       NaN  51.000000   4.800000

In [202]:
# Function Applications
df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
df

       col1      col2      col3
0  1.412925  0.620798 -0.225142
1 -0.471150 -0.192294 -0.898335
2  0.475914 -1.081775  0.855254
3 -0.453756  1.631954  0.220072
4 -0.584760 -1.009738 -0.847122

In [203]:
# pipe
def add(x1,x2):
    return x1+x2
df.pipe(add, 2)

       col1      col2      col3
0  3.412925  2.620798  1.774858
1  1.528850  1.807706  1.101665
2  2.475914  0.918225  2.855254
3  1.546244  3.631954  2.220072
4  1.415240  0.990262  1.152878

In [204]:
def sqr(x):
    return x*x
df.pipe(add, 2).pipe(sqr)

        col1       col2      col3
0  11.648060   6.868583  3.150122
1   2.337383   3.267801  1.213666
2   6.130148   0.843137  8.152476
3   2.390871  13.191093  4.928719
4   2.002906   0.980619  1.329127

In [205]:
# apply
# applies a fn to row or column

In [206]:
# applymap
# applies a fn elementwise

In [211]:
df.applymap(lambda x:x*100).applymap(lambda x:x/2)

        col1       col2       col3
0  70.646274  31.039905 -11.257081
1 -23.557491  -9.614702 -44.916756
2  23.795679 -54.088766  42.762704
3 -22.687788  81.597724  11.003591
4 -29.237977 -50.486884 -42.356112

In [219]:
# Reindex
N = 20
df = pd.DataFrame({
    'A': pd.date_range(start='2018-10-10',periods=N,freq='D'),
    'B': np.linspace(start=0, stop=20, num=N),
    'y': np.random.rand(N),
    'C': np.random.choice(['Low','Medium','High'],N).tolist(),
    'D': np.random.normal(100, 10, size=(N)).tolist()
})
df

            A          B         y       C           D
0  2018-10-10   0.000000  0.158708  Medium   95.036644
1  2018-10-11   1.052632  0.350329     Low   97.584579
2  2018-10-12   2.105263  0.970320  Medium  108.863638
3  2018-10-13   3.157895  0.896593     Low  100.811588
4  2018-10-14   4.210526  0.341502     Low   85.787100
5  2018-10-15   5.263158  0.720632  Medium  101.375240
6  2018-10-16   6.315789  0.979762  Medium  102.000472
7  2018-10-17   7.368421  0.893247    High   93.827934
8  2018-10-18   8.421053  0.772732    High  115.389815
9  2018-10-19   9.473684  0.676918     Low  116.102466
10 2018-10-20  10.526316  0.864807  Medium  120.855320
11 2018-10-21  11.578947  0.185409  Medium  101.029540
12 2018-10-22  12.631579  0.667926    High  112.087879
13 2018-10-23  13.684211  0.171043    High  106.581016
14 2018-10-24  14.736842  0.710024    High  109.735013
15 2018-10-25  15.789474  0.884408  Medium  110.304142
16 2018-10-26  16.842105  0.498005     Low   78.716986
17 2018-10-27  17.894737  0.267274  Medium  104.188888
18 2018-10-28  18.947368  0.159706     Low   76.352011
19 2018-10-29  20.000000  0.716561    High  109.549883

In [220]:
df.reindex(index=[0,2,5], columns=['A','E','B'])

           A   E         B
0 2018-10-10 NaN  0.000000
2 2018-10-12 NaN  2.105263
5 2018-10-15 NaN  5.263158

In [222]:
# reindex_like

In [223]:
df1 = pd.DataFrame(np.random.randn(10,3),columns=['col1','col2','col3'])
df2 = pd.DataFrame(np.random.randn(7,3),columns=['col1','col2','col3'])
df1.reindex_like(df2)

       col1      col2      col3
0  0.145716  0.914499 -1.518231
1  0.729637 -1.008266  0.642547
2 -0.344783 -0.241102  1.776459
3  0.133343 -0.442335  0.714104
4 -0.685349 -1.397637  0.259061
5  0.640644  1.690177 -0.620053
6  0.300334  0.373194 -1.444931

In [229]:
df1 = pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])
df2 = pd.DataFrame(np.random.randn(2,3),columns=['col1','col2','col3'])

# Padding NAN's
df2.reindex_like(df1)

       col1      col2      col3
0 -1.478059 -0.767819  1.867394
1 -0.461746 -0.669603  0.521655
2       NaN       NaN       NaN
3       NaN       NaN       NaN
4       NaN       NaN       NaN
5       NaN       NaN       NaN

In [233]:
df2

       col1      col2      col3
0 -1.478059 -0.767819  1.867394
1 -0.461746 -0.669603  0.521655

In [234]:
df2.reindex_like(df1, method='ffill')

       col1      col2      col3
0 -1.478059 -0.767819  1.867394
1 -0.461746 -0.669603  0.521655
2 -0.461746 -0.669603  0.521655
3 -0.461746 -0.669603  0.521655
4 -0.461746 -0.669603  0.521655
5 -0.461746 -0.669603  0.521655

In [235]:
df2.reindex_like(df1, method='bfill')

       col1      col2      col3
0 -1.478059 -0.767819  1.867394
1 -0.461746 -0.669603  0.521655
2       NaN       NaN       NaN
3       NaN       NaN       NaN
4       NaN       NaN       NaN
5       NaN       NaN       NaN

In [236]:
# Renaming

In [237]:
df1 = pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])
df1

       col1      col2      col3
0  0.086720  0.879024  0.724705
1 -0.216444  0.058170  0.604198
2 -2.354620 -1.255891 -0.004488
3  0.703570 -0.984591 -0.917523
4  0.617125 -0.762704 -0.214350
5 -1.293663 -1.487022  0.353611

In [238]:
df1.rename(columns={'col1':'c1', 'col2':'c2', 'col3':'c3'})

         c1        c2        c3
0  0.086720  0.879024  0.724705
1 -0.216444  0.058170  0.604198
2 -2.354620 -1.255891 -0.004488
3  0.703570 -0.984591 -0.917523
4  0.617125 -0.762704 -0.214350
5 -1.293663 -1.487022  0.353611

In [239]:
# Iteration
content = '''
In short, basic iteration (for i in object) produces −

Series − values

DataFrame − column labels

Panel − item labels
'''

In [244]:
N=20

df = pd.DataFrame({
    'A': pd.date_range(start='2016-01-01',periods=N,freq='D'),
    'x': np.linspace(0,stop=N-1,num=N),
    'y': np.random.rand(N),
    'C': np.random.choice(['Low','Medium','High'],N).tolist(),
    'D': np.random.normal(100, 10, size=(N)).tolist()
    })

for col in df:
    print(col)

A
x
y
C
D

In [249]:
df

            A     x         y       C           D
0  2016-01-01   0.0  0.435540  Medium  106.785780
1  2016-01-02   1.0  0.264397    High  102.164627
2  2016-01-03   2.0  0.929996    High   89.893808
3  2016-01-04   3.0  0.022539     Low   97.123092
4  2016-01-05   4.0  0.499881    High  101.268161
5  2016-01-06   5.0  0.545529  Medium   99.266261
6  2016-01-07   6.0  0.965567  Medium  110.125622
7  2016-01-08   7.0  0.420409    High   91.086346
8  2016-01-09   8.0  0.461375  Medium  107.859901
9  2016-01-10   9.0  0.323467    High  124.400031
10 2016-01-11  10.0  0.849945     Low   94.492428
11 2016-01-12  11.0  0.986893     Low  100.424745
12 2016-01-13  12.0  0.625545    High   99.954507
13 2016-01-14  13.0  0.374814    High   91.361399
14 2016-01-15  14.0  0.183428  Medium  100.011343
15 2016-01-16  15.0  0.327485  Medium   94.593769
16 2016-01-17  16.0  0.237457    High  108.623883
17 2016-01-18  17.0  0.590075     Low  114.943764
18 2016-01-19  18.0  0.735135    High  101.627020
19 2016-01-20  19.0  0.619925  Medium  110.382662

In [247]:
for key,value in df.iteritems():
    print(key)

A
x
y
C
D

In [254]:
for key,value in df.iteritems():
    print(value)
    break

0    2016-01-01
1    2016-01-02
2    2016-01-03
3    2016-01-04
4    2016-01-05
5    2016-01-06
6    2016-01-07
7    2016-01-08
8    2016-01-09
9    2016-01-10
10   2016-01-11
11   2016-01-12
12   2016-01-13
13   2016-01-14
14   2016-01-15
15   2016-01-16
16   2016-01-17
17   2016-01-18
18   2016-01-19
19   2016-01-20
Name: A, dtype: datetime64[ns]

In [257]:
for row_index,row in df.iterrows():
    print(row_index)

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19

In [258]:
for row_index,row in df.iterrows():
    print(row)
# Notice that the dtype changed to object

A    2016-01-01 00:00:00
x                      0
y                0.43554
C                 Medium
D                106.786
Name: 0, dtype: object
A    2016-01-02 00:00:00
x                      1
y               0.264397
C                   High
D                102.165
Name: 1, dtype: object
A    2016-01-03 00:00:00
x                      2
y               0.929996
C                   High
D                89.8938
Name: 2, dtype: object
A    2016-01-04 00:00:00
x                      3
y              0.0225394
C                    Low
D                97.1231
Name: 3, dtype: object
A    2016-01-05 00:00:00
x                      4
y               0.499881
C                   High
D                101.268
Name: 4, dtype: object
A    2016-01-06 00:00:00
x                      5
y               0.545529
C                 Medium
D                99.2663
Name: 5, dtype: object
A    2016-01-07 00:00:00
x                      6
y               0.965567
C                 Medium
D                110.126
Name: 6, dtype: object
A    2016-01-08 00:00:00
x                      7
y               0.420409
C                   High
D                91.0863
Name: 7, dtype: object
A    2016-01-09 00:00:00
x                      8
y               0.461375
C                 Medium
D                 107.86
Name: 8, dtype: object
A    2016-01-10 00:00:00
x                      9
y               0.323467
C                   High
D                  124.4
Name: 9, dtype: object
A    2016-01-11 00:00:00
x                     10
y               0.849945
C                    Low
D                94.4924
Name: 10, dtype: object
A    2016-01-12 00:00:00
x                     11
y               0.986893
C                    Low
D                100.425
Name: 11, dtype: object
A    2016-01-13 00:00:00
x                     12
y               0.625545
C                   High
D                99.9545
Name: 12, dtype: object
A    2016-01-14 00:00:00
x                     13
y               0.374814
C                   High
D                91.3614
Name: 13, dtype: object
A    2016-01-15 00:00:00
x                     14
y               0.183428
C                 Medium
D                100.011
Name: 14, dtype: object
A    2016-01-16 00:00:00
x                     15
y               0.327485
C                 Medium
D                94.5938
Name: 15, dtype: object
A    2016-01-17 00:00:00
x                     16
y               0.237457
C                   High
D                108.624
Name: 16, dtype: object
A    2016-01-18 00:00:00
x                     17
y               0.590075
C                    Low
D                114.944
Name: 17, dtype: object
A    2016-01-19 00:00:00
x                     18
y               0.735135
C                   High
D                101.627
Name: 18, dtype: object
A    2016-01-20 00:00:00
x                     19
y               0.619925
C                 Medium
D                110.383
Name: 19, dtype: object

In [260]:
for tpl in df.itertuples():
    print(tpl)
    print(type(tpl))

Pandas(Index=0, A=Timestamp('2016-01-01 00:00:00'), x=0.0, y=0.43554049242122994, C='Medium', D=106.78577955230796)
<class 'pandas.core.frame.Pandas'>
Pandas(Index=1, A=Timestamp('2016-01-02 00:00:00'), x=1.0, y=0.2643969496035412, C='High', D=102.16462712586309)
<class 'pandas.core.frame.Pandas'>
Pandas(Index=2, A=Timestamp('2016-01-03 00:00:00'), x=2.0, y=0.9299964231815235, C='High', D=89.8938082674727)
<class 'pandas.core.frame.Pandas'>
Pandas(Index=3, A=Timestamp('2016-01-04 00:00:00'), x=3.0, y=0.02253940733403237, C='Low', D=97.12309197206285)
<class 'pandas.core.frame.Pandas'>
Pandas(Index=4, A=Timestamp('2016-01-05 00:00:00'), x=4.0, y=0.499881404749524, C='High', D=101.2681609997965)
<class 'pandas.core.frame.Pandas'>
Pandas(Index=5, A=Timestamp('2016-01-06 00:00:00'), x=5.0, y=0.5455293426572346, C='Medium', D=99.26626096362355)
<class 'pandas.core.frame.Pandas'>
Pandas(Index=6, A=Timestamp('2016-01-07 00:00:00'), x=6.0, y=0.9655665888989786, C='Medium', D=110.12562246147243)
<class 'pandas.core.frame.Pandas'>
Pandas(Index=7, A=Timestamp('2016-01-08 00:00:00'), x=7.0, y=0.4204089093022546, C='High', D=91.08634584159526)
<class 'pandas.core.frame.Pandas'>
Pandas(Index=8, A=Timestamp('2016-01-09 00:00:00'), x=8.0, y=0.4613752746716593, C='Medium', D=107.85990099076774)
<class 'pandas.core.frame.Pandas'>
Pandas(Index=9, A=Timestamp('2016-01-10 00:00:00'), x=9.0, y=0.3234673565730699, C='High', D=124.40003088997298)
<class 'pandas.core.frame.Pandas'>
Pandas(Index=10, A=Timestamp('2016-01-11 00:00:00'), x=10.0, y=0.8499449148268955, C='Low', D=94.49242831563662)
<class 'pandas.core.frame.Pandas'>
Pandas(Index=11, A=Timestamp('2016-01-12 00:00:00'), x=11.0, y=0.9868932437484541, C='Low', D=100.42474454755535)
<class 'pandas.core.frame.Pandas'>
Pandas(Index=12, A=Timestamp('2016-01-13 00:00:00'), x=12.0, y=0.6255450594066113, C='High', D=99.95450719809342)
<class 'pandas.core.frame.Pandas'>
Pandas(Index=13, A=Timestamp('2016-01-14 00:00:00'), x=13.0, y=0.3748135334986912, C='High', D=91.36139865402218)
<class 'pandas.core.frame.Pandas'>
Pandas(Index=14, A=Timestamp('2016-01-15 00:00:00'), x=14.0, y=0.1834281360737805, C='Medium', D=100.01134347391695)
<class 'pandas.core.frame.Pandas'>
Pandas(Index=15, A=Timestamp('2016-01-16 00:00:00'), x=15.0, y=0.3274847507364269, C='Medium', D=94.59376892336758)
<class 'pandas.core.frame.Pandas'>
Pandas(Index=16, A=Timestamp('2016-01-17 00:00:00'), x=16.0, y=0.2374571592309681, C='High', D=108.62388298196561)
<class 'pandas.core.frame.Pandas'>
Pandas(Index=17, A=Timestamp('2016-01-18 00:00:00'), x=17.0, y=0.5900754023613235, C='Low', D=114.94376408104311)
<class 'pandas.core.frame.Pandas'>
Pandas(Index=18, A=Timestamp('2016-01-19 00:00:00'), x=18.0, y=0.7351348956458469, C='High', D=101.62701960944216)
<class 'pandas.core.frame.Pandas'>
Pandas(Index=19, A=Timestamp('2016-01-20 00:00:00'), x=19.0, y=0.6199251695071506, C='Medium', D=110.38266220692377)
<class 'pandas.core.frame.Pandas'>

In [ ]:
Note = '''
Note : Do not try to modify any object while iterating. 
'''

In [261]:
#Sorting

In [264]:
unsorted_df = pd.DataFrame(np.random.randn(10,2),index=[1,4,6,2,3,5,9,8,0,7],columns = ['col2','col1'])
unsorted_df

       col2      col1
1 -0.704368  0.643870
4  1.813151 -1.654571
6  2.445154  0.094929
2  1.177953 -0.599812
3  0.119296  0.716329
5 -1.158001  1.728426
9  0.651421 -0.466001
8 -0.701854  1.070915
0  2.035709 -0.781312
7  0.102596 -0.260554

In [265]:
unsorted_df.sort_index()

       col2      col1
0  2.035709 -0.781312
1 -0.704368  0.643870
2  1.177953 -0.599812
3  0.119296  0.716329
4  1.813151 -1.654571
5 -1.158001  1.728426
6  2.445154  0.094929
7  0.102596 -0.260554
8 -0.701854  1.070915
9  0.651421 -0.466001

In [266]:
unsorted_df.sort_index(axis=1)

       col1      col2
1  0.643870 -0.704368
4 -1.654571  1.813151
6  0.094929  2.445154
2 -0.599812  1.177953
3  0.716329  0.119296
5  1.728426 -1.158001
9 -0.466001  0.651421
8  1.070915 -0.701854
0 -0.781312  2.035709
7 -0.260554  0.102596

In [268]:
unsorted_df.sort_index(ascending=False)

       col2      col1
9  0.651421 -0.466001
8 -0.701854  1.070915
7  0.102596 -0.260554
6  2.445154  0.094929
5 -1.158001  1.728426
4  1.813151 -1.654571
3  0.119296  0.716329
2  1.177953 -0.599812
1 -0.704368  0.643870
0  2.035709 -0.781312

In [274]:
unsorted_df.sort_values(by=['col1'])

       col2      col1
4  1.813151 -1.654571
0  2.035709 -0.781312
2  1.177953 -0.599812
9  0.651421 -0.466001
7  0.102596 -0.260554
6  2.445154  0.094929
1 -0.704368  0.643870
3  0.119296  0.716329
8 -0.701854  1.070915
5 -1.158001  1.728426

In [275]:
# Python Pandas - Options and Customization

In [276]:
functions = '''
get_option()
set_option()
reset_option()
describe_option()
option_context()
'''

In [277]:
Frequently used Parameters='''
S.No	Parameter	Description
1	display.max_rows	Displays maximum number of rows to display
2	2 display.max_columns	Displays maximum number of columns to display
3	display.expand_frame_repr	Displays DataFrames to Stretch Pages
4	display.max_colwidth	Displays maximum column width
5	display.precision	Displays precision for decimal numbers
'''

SyntaxError: invalid syntax (<ipython-input-277-de5688eecc28>, line 1)

In [278]:
# Indexing and Selecting Data

In [280]:
# loc
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])
df

          A         B         C         D
a -0.105998  0.392277 -0.635048  0.928495
b  0.610982  2.720923  0.350088 -1.314750
c -0.367427  2.870486  1.570195 -0.443719
d -0.536239 -0.760567  0.248396 -0.778989
e  0.485665 -1.040113  0.769886 -0.101239
f -0.600791  0.723119  0.970913  0.659215
g -0.792325  0.503394  0.455441  0.176146
h  1.545666 -0.280210  1.392391 -1.803462

In [282]:
df['A']

a   -0.105998
b    0.610982
c   -0.367427
d   -0.536239
e    0.485665
f   -0.600791
g   -0.792325
h    1.545666
Name: A, dtype: float64

In [284]:
df.loc['a','A']

-0.10599785791083484

In [285]:
df.loc[['a','b'],['A','B']]

          A         B
a -0.105998  0.392277
b  0.610982  2.720923

In [286]:
#iloc

In [287]:
#ix

In [288]:
# Attribute access
df.A

a   -0.105998
b    0.610982
c   -0.367427
d   -0.536239
e    0.485665
f   -0.600791
g   -0.792325
h    1.545666
Name: A, dtype: float64

In [289]:
# Statistical functions
# pct_change
# cov
# corr
# ranking

In [290]:
# ranking
s = pd.Series(np.random.np.random.randn(5), index=list('abcde'))
s['d'] = s['b']
s

a    0.468069
b    0.128322
c   -0.224915
d    0.128322
e    0.703325
dtype: float64

In [292]:
s.rank()

a    4.0
b    2.5
c    1.0
d    2.5
e    5.0
dtype: float64